{
    "version": "https://jsonfeed.org/version/1",
    "title": "Hi! I&#x27;m Ada",
    "description": "",
    "home_page_url": "https://homolova.sk",
    "feed_url": "https://homolova.sk/feed.json",
    "user_comment": "",
    "author": {
        "name": "Ada Homolova"
    },
    "items": [
        {
            "id": "https://homolova.sk/blog/topics-that-matter-most/",
            "url": "https://homolova.sk/blog/topics-that-matter-most/",
            "title": "Your most important topics in 2025",
            "summary": "At the end of 2024, I asked a couple of friends and colleagues a question: \"Which topic do you think is the most important to&hellip;",
            "content_html": "<p>At the end of 2024, I asked a couple of friends and colleagues a question: \"Which topic do you think is the most important to write about next year?\" and got some very diverse answers. A friend designer and visual artist said to make people aware that no piece of information is neutral. A colleague pondered the power Musk and his satellites. And another friend told me: \"Nothing. I can't do anything with the news.\" </p>\n<p>The conversations were so interensting that I decided to scale it up a bit. Enf of November I tossed a survey into my network and left it cook there for a couple of weeks. This got me a fresh batch of <strong>31 answers </strong>to think about.</p>\n<p>Some of the topics made an expected appearance. Like <em>climate, </em>that got mentioned all in all 11 times accross all the answers. But many surprised me too. And so I have been diving into among democracy metrics, world population predictions, duck curves and dark data.</p>\n<p>After putting everything together, it became a bit of an mammoth of a post. I therefore decided to split it up in multiple parts. In this first part, I will talk about the (simple) analysis I used to structure the answers and share with you the first unsurprising of the categories: <em>world order</em><em>.</em></p>\n<h1>Analysis</h1>\n<p>While the survey was open, I have thought many of modern and hyped means to analyse and visualise the data. Shall I use an LLM? After browsing the huggingface <a href=\"https://huggingface.co/models\">models</a> for a bit looking for an angle, I had to think about what my data actually were. They were not numbers, they were little stories. And that to make sense of stories, I had to attend to them with attention and understanding. So I quickly closed the browser tab with the models and opened the spreadsheet with the answers. Then I stared at them for a couple of hours. And then a couple more.</p>\n<p>To introduce some structure, I needed to add a tiny bit of abstraction. And my beautiful organic brain was just the right tool to do this. First, I wrote down a couple of keywords for every answer. Then I looked for overlaps and bigger lines within these keywords and distilled those into a single category.</p>\n<p>The categories I came up with are 🥁: <strong>climate &amp; energy, </strong><strong>world order, conflict, information, oneness, demographics, housing, human rights, journalism, </strong>and<strong> trust. </strong>There are of course overlaps between them. But I did my best to get the most prominent theme out of the answer to paint larger trends.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://homolova.sk/media/posts/10/categories.png\" alt=\"\" width=\"632\" height=\"749\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://homolova.sk/media/posts/10/responsive/categories-xs.png 300w ,https://homolova.sk/media/posts/10/responsive/categories-sm.png 480w ,https://homolova.sk/media/posts/10/responsive/categories-md.png 768w ,https://homolova.sk/media/posts/10/responsive/categories-lg.png 1024w\"></figure>\n<p>Below you can find the answers from the first of the most prominent categories: <strong>world order</strong>.<strong> </strong>The answers are given in full, only lightly edited, including some reflection, data and other resources from me. Enjoy!</p>\n<h2>World order</h2>\n<p>The answers in this category revolve around the changing political climate. They are concerned with the rise of populistic leaders, far-right sentiment and changing role of US. They ask what the modern democracies are heading towards.</p>\n<blockquote>\n<p> 1. Europe: European Union, how Europe is becoming more and more right-wing</p>\n</blockquote>\n<p>Simple and straight forward. And it has some interesting repercussions as well. After recently Austrian government failed to form a coalition, <a href=\"https://www.reuters.com/world/europe/austrian-coalition-talks-collapse-chancellor-step-down-2025-01-04/\" target=\"_blank\" rel=\"noopener\">Reuters</a> concluded there is a \"growing difficulty of forming stable governments in European countries [...] where the far right is on the rise but many parties are loath to partner with them.<em>\"</em></p>\n<p>I wanted to check this claim, but the most recent data analysis I found was <a href=\"https://journals.sagepub.com/doi/10.1177/2053168015622796\" target=\"_blank\" rel=\"noopener\">from 2015.</a> In the process I found this wondeful data from <a href=\"https://www.parlgov.org/data-info/\" target=\"_blank\" rel=\"noopener\">parlgov</a>, they unfortunately don't seem to make it possible to calculate how long a formation took.</p>\n<blockquote>\n<p>2. The democracy is under pressure in Europe, in some countries more than others. In the Netherlands, people generally believe everything is still OK,  but also here the democracy gets weaker and weaker. It would be good to get some relevant data, do some comparisons, pick some interesting examples and raise some awareness on this. </p>\n</blockquote>\n<p>I wondered what metrics were used to measure the strength of a democracy, so I fired up my <a href=\"/blog/making-internet-search-your-own/\" target=\"_blank\" rel=\"noopener\">ecosia search</a> and found a quite impressive post on the <a href=\"https://ourworldindata.org/democracies-measurement\"></a><a href=\"https://ourworldindata.org/democracies-measurement\" target=\"_blank\" rel=\"noopener noreferrer\">eight leading indexes to measure democracy</a> by Our World in Data. Spending some time exploring them in their <a href=\"https://ourworldindata.org/explorers/democracy?Dataset=Varieties+of+Democracy&amp;Metric=Electoral+democracy&amp;Sub-metric=Main+index&amp;country=ARG~AUS~BWA~CHN~OWID_WRL\" target=\"_blank\" rel=\"noopener\">interactive visualisations</a> I also found that there just might be something to it.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://homolova.sk/media/posts/10/vdemnetherlands.png\" alt=\"V-Dem index in the Netherlands going down\" width=\"839\" height=\"605\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://homolova.sk/media/posts/10/responsive/vdemnetherlands-xs.png 300w ,https://homolova.sk/media/posts/10/responsive/vdemnetherlands-sm.png 480w ,https://homolova.sk/media/posts/10/responsive/vdemnetherlands-md.png 768w ,https://homolova.sk/media/posts/10/responsive/vdemnetherlands-lg.png 1024w\"></figure>\n<blockquote>\n<p>3. Totalitarianism in Europe. Totalitarian trends (or fear of totalitarian trends, fear of public unrest, active instrumentalisation of groups in difficult political challenges) overshadow meaningful political discussions on all important topics such as the climate crisis, inequality and polarisation in societies, environmental issues such as pollution with chemicals, plastics and the resulting health crisis... The general wish to maintain a \"business as usual\" approach in spite of all the above concerns may be among the keys to start covering this challenge. </p>\n</blockquote>\n<p>Connected to the previous answer, this one as I understand it, suggests that we focus on totalitarian trends in Europe, to get them out of the way so we can focus on the really important topics.</p>\n<p>Another three answers were focusing us on the situation in the US, with Trump and Musk at the wheel.</p>\n<blockquote>\n<p>4. The change in geopolitics brought on by the US elections. With Trump (and Musk) getting into office, we will see a shift of power away from the state to private individuals. In military conflicts, this has already been foreshadowed by the Starlink story in Ukraine and Musk’s ties to the global far-right. Moreover, capital will become increasingly privatized as the new government aims to unleash anonymous cryptocapitalism. Gradually, governments’ former monetary powers will slip from democratic control.</p>\n</blockquote>\n<blockquote>\n<p>5. Trump and how it influences our safety in Europe or the Pacific even (Taiwan)</p>\n</blockquote>\n<blockquote>\n<p>6. Broligarchy: how tech and similar bros are broing away rights and broifying politics. The bro approach to business and politics shapes social media algorithms, elections, lobbying and political priorities</p>\n</blockquote>\n<p>'Broing away' is now my new favorite verb. But seriously. The most fascinating aspect of the US situation to me is the ultra-rich taking over politics. Although, it is nothing new.</p>\n<p>Chrystia Freeland (then journalist, now the Canadian ex-minister of finance) already <a href=\"https://www.amazon.com/Plutocrats-Rise-Global-Super-Rich-Everyone/dp/1594204098\" target=\"_blank\" rel=\"noopener\">wrote a book</a> about plutocracy rising in 2012<em>:</em> \"As the people at the very top become ever richer, they have an ever greater ability to tilt the rules of the game in their favor. That power can be hard to resist.\" And it's not going away either. In 2023 the population of billionaires in the US <a href=\"https://info.altrata.com/l/311771/2024-11-17/21wbj4/311771/1731871576Li7G5zyb/Altrata_Billionaire_Census_2024.pdf\" target=\"_blank\" rel=\"noopener\">went up by nearly 10%</a> (1,111 people). Both US and Europe hold 1/3 of worlds billionaires, according to the data from Altrata.</p>\n<p>Recently I came across a fascinating essay in the MacGuffin magazine. Here, the author reflects on the world perception of the ultra-rich: \"<em>My main observation is that for individuals born into extreme wealth, it is almost impossible to grasp anything about material or social reality.\"</em> He continues: <em>\"To inherit a condition of unjustifiable wealth means to never experience cause and effect. All external pressures are alleviated by capital: there are no consequences to missing a deadline, to not finishing a project, to dropping out or giving up. It is terrifically difficult to fail, in any normal sense.\"</em> Trump and Musk are both second generation ultra-rich. I recommend to <a href=\"https://www.macguffinmagazine.com/stories/macguffin-plutocrat-archipelagos\" target=\"_blank\" rel=\"noopener\">read the whole essay</a>. It's terrifying. Let's just hope it's not such<a href=\"https://www.economist.com/leaders/2025/01/02/tech-is-coming-to-washington-prepare-for-a-clash-of-cultures\" target=\"_blank\" rel=\"noopener\"> a match made in heaven</a>.</p>\n<blockquote>\n<p>7. Ukraine and and derivative stories such as societal security and preparedness in a new world order, where the climate is also 'attacking' us harder and harder. It is fundamentally about our existence and our way of organizing the world: democracy, equality, diversity - the right to be an independent human being. There is a reason why people fleeing to northern Europe! The refugee flows are not going away from Europe and certainly not away from the northwestern corner. So we do something right here, something other people on this planet wants too. No one flees to the autocracies!</p>\n</blockquote>\n<p>The last answer in this category is hinting at something interesting: <em>we are doing something right here</em>. What is it and can we keep it through the changing world order?</p>\n<p>---</p>\n<p><em>Want to to get the rest of the series in your mailbox? Sign up for my newsletter!</em></p>",
            "image": "https://homolova.sk/media/posts/10/zufanka_Broligarchy_how_tech_and_similar_bros_are_broing_away_4a39518c-15c9-4399-949a-c96b6c77cc3b_1.png",
            "author": {
                "name": "Ada Homolova"
            },
            "tags": [
            ],
            "date_published": "2024-12-30T18:13:47+01:00",
            "date_modified": "2025-01-12T14:56:34+01:00"
        },
        {
            "id": "https://homolova.sk/blog/make-search-your-own/",
            "url": "https://homolova.sk/blog/make-search-your-own/",
            "title": "Make search your own!",
            "summary": "Internet search sucks. It's not just my personal opinion. If you don't trust the media, maybe you do trust the Germans: their university researchers came&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Internet search sucks. It's not just my personal opinion.</span></p>\n<figure class=\"post__image align-center\"><img loading=\"lazy\"  src=\"https://homolova.sk/media/posts/8/googleisgettingworse.png\" alt=\"screenshots of articles about google getting worse\" width=\"1200\" height=\"1200\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://homolova.sk/media/posts/8/responsive/googleisgettingworse-xs.png 300w ,https://homolova.sk/media/posts/8/responsive/googleisgettingworse-sm.png 480w ,https://homolova.sk/media/posts/8/responsive/googleisgettingworse-md.png 768w ,https://homolova.sk/media/posts/8/responsive/googleisgettingworse-lg.png 1024w\"></figure>\n<p><span style=\"font-weight: 400;\">If you don't trust the media, maybe you do trust the Germans: their university researchers came to the same sad conclusion </span><i><span style=\"font-weight: 400;\">“that higher-ranked pages are on average more optimized, more monetized [...] and they show signs of lower text quality”, </span></i><span style=\"font-weight: 400;\">reads their recent</span><a href=\"https://downloads.webis.de/publications/papers/bevendorff_2024a.pdf\"><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">paper</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Maybe you recognize this from recipe websites. While the recipe is the part you are really interested in, at some point in history recipe pages started to bloat. Now you need to plow through a pile of text and pictures before you can even take a look at  the recipe itself. This additional clutter helps individual recipe pages rank better in search results: \"When I’m writing, I try to tell a story that has a hook as well as please[s] the Google algorithm,\", </span><a href=\"https://mashable.com/article/why-are-there-long-stories-on-food-blogs?test_uuid=01iI2GpryXngy77uIpA3Y4B&amp;test_variant=b\"><span style=\"font-weight: 400;\">says this food blogger</span></a><span style=\"font-weight: 400;\">. But what Google wants to show is not necessarily what everybody wants to read. Such ‘optimisation’ then gives birth to projects like </span><a href=\"https://www.justtherecipe.com/\"><span style=\"font-weight: 400;\">justtherecipe.com</span></a><span style=\"font-weight: 400;\"> - a website and app that only extracts the recipe from any given website.</span></p>\n<p><span style=\"font-weight: 400;\">Pessimists say that the internet is only going to </span><a href=\"https://xeiaso.net/blog/birth-death-seo/\"><span style=\"font-weight: 400;\">get more cluttered</span></a><span style=\"font-weight: 400;\">. With the dawn of generative AI, we will swim in more and more low quality content. The internet</span><a href=\"https://github.com/rspeer/wordfreq/blob/master/SUNSET.md\"><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">will never be the same</span></a><span style=\"font-weight: 400;\"> as it was when populated just by us  - the humans. And as much as I love robots, they also produce text that can contradict itself in consecutive sentences;  in a much worse case it can make you</span><a href=\"https://fortune.com/2023/09/03/ai-written-mushroom-hunting-guides-sold-on-amazon-potentially-deadly/\"><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">poison yourself with mushrooms</span></a><span style=\"font-weight: 400;\">. The bots are also capable of making us forget what a baby peacock looks like.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://homolova.sk/media/posts/8/notalwaysbabypeacock.jpg\" alt=\"\" width=\"921\" height=\"996\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://homolova.sk/media/posts/8/responsive/notalwaysbabypeacock-xs.jpg 300w ,https://homolova.sk/media/posts/8/responsive/notalwaysbabypeacock-sm.jpg 480w ,https://homolova.sk/media/posts/8/responsive/notalwaysbabypeacock-md.jpg 768w ,https://homolova.sk/media/posts/8/responsive/notalwaysbabypeacock-lg.jpg 1024w\"></figure>\n<p><span style=\"font-weight: 400;\">So how do we search for high quality content in waters made murky by SEO optimization and generative AI? For me a  search engine is like a map, and I have to keep reminding myself that like a map it only ever shows part of the landscape.</span></p>\n<p><span style=\"font-weight: 400;\">Google has been steadily </span><a href=\"https://gs.statcounter.com/search-engine-market-share#monthly-200901-202409\"><span style=\"font-weight: 400;\">holding about 90%</span></a><span style=\"font-weight: 400;\"> of the search engine market for at least the last 15 years. But the good news is you don’t have to keep on only </span><i><span style=\"font-weight: 400;\">Googling.</span></i><span style=\"font-weight: 400;\"> The key to any healthy diet is variety. So take my hand into the (expanding) possibilities of searching the web.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://homolova.sk/media/posts/8/takemyhand-3.jpg\" alt=\"back of my head and an outstretched arm\" width=\"771\" height=\"622\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://homolova.sk/media/posts/8/responsive/takemyhand-3-xs.jpg 300w ,https://homolova.sk/media/posts/8/responsive/takemyhand-3-sm.jpg 480w ,https://homolova.sk/media/posts/8/responsive/takemyhand-3-md.jpg 768w ,https://homolova.sk/media/posts/8/responsive/takemyhand-3-lg.jpg 1024w\"></figure>\n<p><span style=\"font-weight: 400;\">Every day I use a couple of different search engines. All of them are designed with a different approach to indexing the web.</span></p>\n<h2><span style=\"font-weight: 400;\">Keyword search</span></h2>\n<h3><span style=\"font-weight: 400;\">Ecosia</span></h3>\n<p><a href=\"https://www.ecosia.org/\"><i><span style=\"font-weight: 400;\">Ecosia</span></i></a><span style=\"font-weight: 400;\"> is my default search engine. I use it when I know what I am searching for: company names, people, wikipedia articles, documentation. Under the hood it uses two of the big boys : </span><i><span style=\"font-weight: 400;\">Google</span></i><span style=\"font-weight: 400;\"> and </span><i><span style=\"font-weight: 400;\">Microsoft Bing</span></i><span style=\"font-weight: 400;\">. The search is therefore still not better than Google, but their business is. </span><i><span style=\"font-weight: 400;\">Ecosia</span></i><span style=\"font-weight: 400;\"> is the largest not-for-profit search engine that puts 100% of their revenues into</span><a href=\"https://blog.ecosia.org/ecosia-financial-reports-tree-planting-receipts/\"><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">planting trees</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">As well as search, </span><i><span style=\"font-weight: 400;\">Ecosia</span></i><span style=\"font-weight: 400;\"> also offers a free</span><a href=\"https://www.ecosia.org/chat\"><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">AI chat feature</span></a><span style=\"font-weight: 400;\">, based on GPT-3. This one I use for translations and when I need definitions of some terms or phenomena. I also use it for basic recipes, and tweaks for recipes (especially for baking - which I still find mesmerizing).</span></p>\n<h3><span style=\"font-weight: 400;\">Google</span></h3>\n<p><a href=\"https://www.google.com/\"><i><span style=\"font-weight: 400;\">Google</span></i></a><span style=\"font-weight: 400;\"> is not completely out of my system, but I currently use it only when I can not find things via Ecosia. Google is amazingly good at finding out where to buy things online, so I do my infrequent online shopping ventures on </span><i><span style=\"font-weight: 400;\">Google</span></i><span style=\"font-weight: 400;\">.</span></p>\n<h3><span style=\"font-weight: 400;\">Marginalia</span></h3>\n<p><a href=\"https://search.marginalia.nu/\"><i><span style=\"font-weight: 400;\">Marginalia</span></i></a><span style=\"font-weight: 400;\"> is what I like to see as a serendipity search engine: you never know what you will get. The index is built by Swedish developer, Viktor Löfgren, mostly on grant money (he also has a</span><a href=\"https://www.patreon.com/marginalia_nu\"><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">patreon</span></a><span style=\"font-weight: 400;\">). It  focuses on “small obscure websites and non-commercial content”, as the author puts it. </span></p>\n<p><span style=\"font-weight: 400;\">What I love about </span><i><span style=\"font-weight: 400;\">Marginalia</span></i><span style=\"font-weight: 400;\"> is that when I searched for a recipe for a crumble, instead of one of the sterile over-optimized recipe pages, I discovered the Kitchen Projects substack, where somebody called Nicola Lamb documents their</span><a href=\"https://kitchenprojects.substack.com/p/plum-crumble-pie\"><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">experiments in crumble baking</span></a><span style=\"font-weight: 400;\">. Next to the recipe, she also shares explanations of how baking with fruit works. If this doesn’t give you warm fuzzy feelings for the internet, I don’t know what will.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://homolova.sk/media/posts/8/nicolalammcrumbleexperiments.jpg\" alt=\"Pie thickeners, by Nicola Lamb\" width=\"1200\" height=\"1600\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://homolova.sk/media/posts/8/responsive/nicolalammcrumbleexperiments-xs.jpg 300w ,https://homolova.sk/media/posts/8/responsive/nicolalammcrumbleexperiments-sm.jpg 480w ,https://homolova.sk/media/posts/8/responsive/nicolalammcrumbleexperiments-md.jpg 768w ,https://homolova.sk/media/posts/8/responsive/nicolalammcrumbleexperiments-lg.jpg 1024w\"><figcaption>\n<p><i><span style=\"font-weight: 400;\">Pie thickeners, by Nicola Lamb</span></i></p>\n</figcaption></figure>\n<p><span style=\"font-weight: 400;\">I use </span><i><span style=\"font-weight: 400;\">Marginalia</span></i><span style=\"font-weight: 400;\"> if I am interested in anything related to craft (cooking, basket weaving) or if I feel like online exploration outside the social media ecosystem. Their rainbow</span><a href=\"https://search.marginalia.nu/explore/random\"><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">‘random’</span></a><span style=\"font-weight: 400;\"> button is perfect for that.</span></p>\n<h2><span style=\"font-weight: 400;\">Embeddings search</span></h2>\n<p><span style=\"font-weight: 400;\">LLMs are also taking over internet search. There are new search engines that let you chat with the search results and even formulate new questions based on the previous search.</span></p>\n<p><span style=\"font-weight: 400;\">Two examples of these are Exa and Perplexity. I have discovered them only recently but use them regularly to discover material around a certain topic for my work related searches. </span></p>\n<h3><span style=\"font-weight: 400;\">Perplexity</span></h3>\n<p><a href=\"http://perplexity.ai\"><i><span style=\"font-weight: 400;\">Perplexity</span></i></a><span style=\"font-weight: 400;\"> lets you chat with the internet. The interface is very user friendly and includes all the search results the robot is basing its answer on. But be careful here, because LLM models do hallucinate and as </span><a href=\"https://www.wired.com/story/perplexity-is-a-bullshit-machine/\"><span style=\"font-weight: 400;\">WIRED reported</span></a><span style=\"font-weight: 400;\">: “it falsely claimed that WIRED had reported that a specific police officer in California had committed a crime”. It is therefore more suitable for general overview questions rather than in-depth search.</span></p>\n<h3><span style=\"font-weight: 400;\">Exa</span></h3>\n<p><span style=\"font-weight: 400;\">Where </span><i><span style=\"font-weight: 400;\">perplexity </span></i><span style=\"font-weight: 400;\">makes you chat with the internet directly, </span><a href=\"https://exa.ai/search\"><i><span style=\"font-weight: 400;\">Exa</span></i></a><i><span style=\"font-weight: 400;\"> </span></i><span style=\"font-weight: 400;\">returns actual search results first, that you can then chat with if you like, so resembling an actual search engine more closely. It also (automatically) alternates between keyword search and embeddings-based search depending on what you ask. This is a good call, as keyword search is </span><a href=\"https://www.wired.com/story/ai-energy-demands-water-impact-internet-hyper-consumption-era/\"><span style=\"font-weight: 400;\">less thirsty for resources</span></a><span style=\"font-weight: 400;\">. I also like </span><i><span style=\"font-weight: 400;\">Exa’</span></i><span style=\"font-weight: 400;\">s focus on using LLMs to return relevant search results.</span></p>\n<h2><span style=\"font-weight: 400;\">Premium</span></h2>\n<h3><span style=\"font-weight: 400;\">Kagi</span></h3>\n<p><a href=\"https://kagi.com/\"><i><span style=\"font-weight: 400;\">Kagi</span></i></a><span style=\"font-weight: 400;\"> is the only search engine in the list that you need to pay for - if you want to do more than 100 searches a month. In return they won’t run ads or sell your data. You can personalize their keyword search;  they also offer an AI bot feature where you can choose from a dozen LLMs . </span></p>\n<p><span style=\"font-weight: 400;\">As I don’t have premium access, I use </span><i><span style=\"font-weight: 400;\">Kagi</span></i><span style=\"font-weight: 400;\"> sparingly, for the most in depth part of any research. The search results are very good and it helps me find things that I could not find using any of the other search engines.</span></p>\n<p><span style=\"font-weight: 400;\">—</span></p>\n<p><span style=\"font-weight: 400;\">This list is personal, and by no means exhaustive. I for example don’t use the most famous privacy oriented alternative to Google, </span><a href=\"https://duckduckgo.com/\"><span style=\"font-weight: 400;\">DuckDuckGO</span></a><span style=\"font-weight: 400;\">. There also exists a little army of </span><a href=\"https://www.are.na/elan-kiderman-ullendorff/search-engines-for-wandering\"><span style=\"font-weight: 400;\">small ‘folk’ search engine</span></a><span style=\"font-weight: 400;\"> like </span><i><span style=\"font-weight: 400;\">Marginalia. </span></i><span style=\"font-weight: 400;\">This list is very much a work in progress and a living active process. </span></p>\n<p><span style=\"font-weight: 400;\">The Internet morphs and changes. Looking ahead to 2034 the internet will be at least as different from now as now is different from how things were in 2014. Therefore we need to keep our strategies for navigating it flexible too.</span></p>\n<p><span style=\"font-weight: 400;\">Have other search engines you use and love? I would love to hear about them!</span></p>",
            "image": "https://homolova.sk/media/posts/8/takemyhand.jpg",
            "author": {
                "name": "Ada Homolova"
            },
            "tags": [
                   "search",
                   "exa.ai",
                   "blog"
            ],
            "date_published": "2024-10-13T17:29:07+02:00",
            "date_modified": "2024-11-06T22:03:21+01:00"
        }
    ]
}
